OpenFOAM/foam9tutorials/interfluo/OpenFOAM-pisoFoam-LES-VonKarman-3-main/OpenFOAM-pisoFoam-LES-VonKarman-3-main/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          880;
        startFace       134412;
    }
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       135292;
    }
    outlet
    {
        type            patch;
        nFaces          160;
        startFace       135452;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          135016;
        startFace       135612;
    }
)

// ************************************************************************* //
